line7 = ['장암', '도봉산', '마들', '노원', '중계', '하계', '공릉', '태릉입구', '먹골', '중화', '상봉', '면목', '사가정', '용마산', '뚝섬유원지', '청담', '강남구청', '학동', '논현', '반포', '고속터미널', '내방', '이수', '남성', '숭실대입구', '중곡', '군자', '어린이대공원', '건대입구', '수락산', '상도', '장승배기', '신대방삼거리', '보라매', '신풍', '대림', '남구로', '가산디지털단지', '철산', '광명사거리', '천왕', '온수', '까치울', '부천종합운동장', '춘의', '신중동', '부천시청', '상동', '삼산체육관', '굴포천', '부평구청', '산곡', '석남']

line9 = ['공항시장', '동작', '구반포', '개화', '김포공항', '신방화', '마곡나루', '양천향교', '가양', '증미', '등촌', '염창', '신목동', '선유도', '당산', '국회의사당', '여의도', '샛강', '노량진', '노들', '흑석', '신반포', '사평', '신논현', '언주', '선정릉', '삼성중앙', '종합운동장', '삼전', '석촌고분', '석촌', '송파나루', '한성백제', '올림픽공원', '둔촌오륜', '중앙보훈병원', '고속터미널', '봉은사']

line7_station = len(line7)
print(line7_station)

line9_station = len(line9)
print(line9_station)

isJunggok_Line7 = '중곡' in line7
print(isJunggok_Line7)

isNodeul_Line9 = '노들' in line9
print(isNodeul_Line9)